% ================================================================
% Визуализация результатов
% ================================================================
function [] = plo()
    % Пример матриц
    a1 = zeros(9);
    c  = [30,25,20,15,2,7,5.1,5.01,5.001];
    c2 = [14,10,5,3,1,0.1,0.01,0.01];
    c3 = [14,10,5,3,1,10,20,30];
    A = diag(c) + diag(c2,1) + a1;

        [e1,m1,m2,m3,m4,s1,s2,s3] = hsap_H_and_HH(0.1,35,A);


    % ----- Построение графиков -----
    figure
    plot(e1, log10(m1), 'blue', 'LineWidth', 2.3); hold on; %график спектральных портретов методом итерационных уточнений
    plot(e1, log10(m2), 'red', 'LineWidth', 1.4); %график спектральных портретов методом Малышева
    xlabel('r');
    ylabel('$\log_{10} \| H \|$', 'Interpreter', 'latex');
    legend('Комбинированный метод','Метод Малышева', 'Location', 'northeast');
    set(gca,'FontSize',30);



    figure
    plot(e1, log10(m3), 'blue', 'LineWidth', 2.3); hold on; %график точности решения методом итерационных уточнений
    plot(e1, log10(m4), 'red', 'LineWidth', 1.4); %график точности решения методом Малышева
    xlabel('r');
    ylabel('$\log_{10} \| H_j - H_{j-1} \|$', 'Interpreter', 'latex');
    legend('Комбинированный метод','Метод Малышева', 'Location', 'northeast');
    set(gca,'FontSize',30);



    figure
    plot(e1, s1, 'blue', 'LineWidth', 1.4); hold on; % график количества итераций для нахождения  решения x1
    plot(e1, s2, 'green', 'LineWidth', 1.4); % график количества итераций для нахождения  решения y1
    plot(e1, s3, 'red', 'LineWidth', 1.4); % график количества итераций в алгоритме Малышева
    xlabel('r');
    ylabel('Количество итераций' );
    legend('Итерации для U_1','Итерации для U_2','Метод Малышева','Location','northeast');
    set(gca,'FontSize',30);


